Just saw I'm on 0.15 and 1.0.2 is released. I updated but nothing changed.

See 2 `terraform apply` back to back (see timestamps) (after deleting everything including the state files and re-init)

You'll also see per my other ticket (https://github.com/UpCloudLtd/terraform-provider-upcloud/issues/168)  the tags not applying properly. Maybe because the tag fails the state is corrupted?

```
➜  terraform git:(main) ✗ terraform apply
2021-07-16T16:26:50.375-0400 [DEBUG] Adding temp file log sink: /var/folders/ck/v6sncj6n0h32mmm73qbm73p40000gn/T/terraform-log457476335
2021-07-16T16:26:50.375-0400 [INFO]  Terraform version: 1.0.2
2021-07-16T16:26:50.375-0400 [INFO]  Go runtime version: go1.16.5
2021-07-16T16:26:50.375-0400 [INFO]  CLI args: []string{"/usr/local/bin/terraform", "apply"}
2021-07-16T16:26:50.375-0400 [DEBUG] Attempting to open CLI config file: /Users/patrickleblanc/.terraformrc
2021-07-16T16:26:50.375-0400 [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2021-07-16T16:26:50.375-0400 [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2021-07-16T16:26:50.375-0400 [DEBUG] ignoring non-existing provider search directory /Users/patrickleblanc/.terraform.d/plugins
2021-07-16T16:26:50.375-0400 [DEBUG] ignoring non-existing provider search directory /Users/patrickleblanc/Library/Application Support/io.terraform/plugins
2021-07-16T16:26:50.375-0400 [DEBUG] ignoring non-existing provider search directory /Library/Application Support/io.terraform/plugins
2021-07-16T16:26:50.376-0400 [INFO]  CLI command args: []string{"apply"}
2021-07-16T16:26:50.378-0400 [DEBUG] New state was assigned lineage "c032e4ae-38ce-69d8-7cda-62c1290ec7fb"
2021-07-16T16:26:50.430-0400 [DEBUG] checking for provisioner in "."
2021-07-16T16:26:50.435-0400 [DEBUG] checking for provisioner in "/usr/local/bin"
2021-07-16T16:26:50.435-0400 [INFO]  Failed to read plugin lock file .terraform/plugins/darwin_amd64/lock.json: open .terraform/plugins/darwin_amd64/lock.json: no such file or directory
2021-07-16T16:26:50.435-0400 [INFO]  backend/local: starting Apply operation
2021-07-16T16:26:50.437-0400 [DEBUG] created provider logger: level=debug
2021-07-16T16:26:50.437-0400 [INFO]  provider: configuring client automatic mTLS
2021-07-16T16:26:50.477-0400 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 args=[.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1]
2021-07-16T16:26:50.482-0400 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=65178
2021-07-16T16:26:50.482-0400 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1
2021-07-16T16:26:50.496-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: configuring server automatic mTLS: timestamp=2021-07-16T16:26:50.496-0400
2021-07-16T16:26:50.539-0400 [DEBUG] provider.terraform-provider-upcloud_v2.1.1: plugin address: network=unix address=/var/folders/ck/v6sncj6n0h32mmm73qbm73p40000gn/T/plugin448748353 timestamp=2021-07-16T16:26:50.539-0400
2021-07-16T16:26:50.539-0400 [DEBUG] provider: using plugin: version=5
2021-07-16T16:26:50.602-0400 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-07-16T16:26:50.604-0400 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=65178
2021-07-16T16:26:50.604-0400 [DEBUG] provider: plugin exited
2021-07-16T16:26:50.605-0400 [INFO]  terraform: building graph: GraphTypeValidate
2021-07-16T16:26:50.605-0400 [DEBUG] ProviderTransformer: "upcloud_server.lb" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/upcloudltd/upcloud"]
2021-07-16T16:26:50.605-0400 [DEBUG] ProviderTransformer: "upcloud_network.woogo-private-network" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/upcloudltd/upcloud"]
2021-07-16T16:26:50.606-0400 [DEBUG] ReferenceTransformer: "var.public_key" references: []
2021-07-16T16:26:50.606-0400 [DEBUG] ReferenceTransformer: "var.zone" references: []
2021-07-16T16:26:50.606-0400 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/upcloudltd/upcloud\"]" references: []
2021-07-16T16:26:50.606-0400 [DEBUG] ReferenceTransformer: "upcloud_network.woogo-private-network" references: []
2021-07-16T16:26:50.606-0400 [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-07-16T16:26:50.606-0400 [DEBUG] ReferenceTransformer: "upcloud_server.lb" references: [upcloud_network.woogo-private-network var.public_key]
2021-07-16T16:26:50.607-0400 [DEBUG] Starting graph walk: walkValidate
2021-07-16T16:26:50.607-0400 [DEBUG] created provider logger: level=debug
2021-07-16T16:26:50.607-0400 [INFO]  provider: configuring client automatic mTLS
2021-07-16T16:26:50.648-0400 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 args=[.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1]
2021-07-16T16:26:50.651-0400 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=65179
2021-07-16T16:26:50.651-0400 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1
2021-07-16T16:26:50.665-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: configuring server automatic mTLS: timestamp=2021-07-16T16:26:50.665-0400
2021-07-16T16:26:50.711-0400 [DEBUG] provider.terraform-provider-upcloud_v2.1.1: plugin address: address=/var/folders/ck/v6sncj6n0h32mmm73qbm73p40000gn/T/plugin548082126 network=unix timestamp=2021-07-16T16:26:50.710-0400
2021-07-16T16:26:50.711-0400 [DEBUG] provider: using plugin: version=5
2021-07-16T16:26:50.766-0400 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-07-16T16:26:50.768-0400 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=65179
2021-07-16T16:26:50.768-0400 [DEBUG] provider: plugin exited
2021-07-16T16:26:50.768-0400 [INFO]  backend/local: apply calling Plan
2021-07-16T16:26:50.768-0400 [INFO]  terraform: building graph: GraphTypePlan
2021-07-16T16:26:50.769-0400 [DEBUG] ProviderTransformer: "upcloud_network.woogo-private-network (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/upcloudltd/upcloud"]
2021-07-16T16:26:50.769-0400 [DEBUG] ProviderTransformer: "upcloud_server.lb (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/upcloudltd/upcloud"]
2021-07-16T16:26:50.769-0400 [DEBUG] ReferenceTransformer: "upcloud_network.woogo-private-network (expand)" references: []
2021-07-16T16:26:50.769-0400 [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-07-16T16:26:50.769-0400 [DEBUG] ReferenceTransformer: "upcloud_server.lb (expand)" references: [upcloud_network.woogo-private-network (expand) var.public_key]
2021-07-16T16:26:50.769-0400 [DEBUG] ReferenceTransformer: "var.public_key" references: []
2021-07-16T16:26:50.769-0400 [DEBUG] ReferenceTransformer: "var.zone" references: []
2021-07-16T16:26:50.769-0400 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/upcloudltd/upcloud\"]" references: []
2021-07-16T16:26:50.770-0400 [DEBUG] Starting graph walk: walkPlan
2021-07-16T16:26:50.770-0400 [DEBUG] created provider logger: level=debug
2021-07-16T16:26:50.770-0400 [INFO]  provider: configuring client automatic mTLS
2021-07-16T16:26:50.811-0400 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 args=[.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1]
2021-07-16T16:26:50.814-0400 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=65180
2021-07-16T16:26:50.815-0400 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1
2021-07-16T16:26:50.827-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: configuring server automatic mTLS: timestamp=2021-07-16T16:26:50.827-0400
2021-07-16T16:26:50.869-0400 [DEBUG] provider.terraform-provider-upcloud_v2.1.1: plugin address: address=/var/folders/ck/v6sncj6n0h32mmm73qbm73p40000gn/T/plugin996850907 network=unix timestamp=2021-07-16T16:26:50.869-0400
2021-07-16T16:26:50.869-0400 [DEBUG] provider: using plugin: version=5
2021-07-16T16:26:50.923-0400 [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/upcloudltd/upcloud\"]" changed the config value, but that value is unused
2021-07-16T16:26:51.402-0400 [DEBUG] Resource instance state not found for node "upcloud_network.woogo-private-network", instance upcloud_network.woogo-private-network
2021-07-16T16:26:51.403-0400 [DEBUG] ReferenceTransformer: "upcloud_network.woogo-private-network" references: []
2021-07-16T16:26:51.403-0400 [DEBUG] refresh: upcloud_network.woogo-private-network: no state, so not refreshing
2021-07-16T16:26:51.406-0400 [DEBUG] Resource instance state not found for node "upcloud_server.lb[0]", instance upcloud_server.lb[0]
2021-07-16T16:26:51.406-0400 [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-07-16T16:26:51.406-0400 [INFO]  ReferenceTransformer: reference not found: "var.public_key"
2021-07-16T16:26:51.406-0400 [DEBUG] ReferenceTransformer: "upcloud_server.lb[0]" references: []
2021-07-16T16:26:51.407-0400 [DEBUG] refresh: upcloud_server.lb[0]: no state, so not refreshing
2021-07-16T16:26:51.408-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:26:51 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2021-07-16T16:26:51.408-0400
2021-07-16T16:26:51.411-0400 [WARN]  Provider "registry.terraform.io/upcloudltd/upcloud" produced an invalid plan for upcloud_server.lb[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .network_interface[0].bootable: planned value cty.False for a non-computed attribute
      - .network_interface[0].ip_address_family: planned value cty.StringVal("IPv4") for a non-computed attribute
      - .network_interface[0].source_ip_filtering: planned value cty.True for a non-computed attribute
      - .network_interface[1].source_ip_filtering: planned value cty.True for a non-computed attribute
      - .network_interface[1].bootable: planned value cty.False for a non-computed attribute
      - .network_interface[1].ip_address_family: planned value cty.StringVal("IPv4") for a non-computed attribute
      - .network_interface[2].ip_address_family: planned value cty.StringVal("IPv4") for a non-computed attribute
      - .network_interface[2].source_ip_filtering: planned value cty.True for a non-computed attribute
      - .network_interface[2].bootable: planned value cty.False for a non-computed attribute
2021-07-16T16:26:51.412-0400 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-07-16T16:26:51.414-0400 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=65180
2021-07-16T16:26:51.414-0400 [DEBUG] provider: plugin exited

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # upcloud_network.woogo-private-network will be created
  + resource "upcloud_network" "woogo-private-network" {
      + id      = (known after apply)
      + name    = "woogo-private-network"
      + servers = (known after apply)
      + type    = (known after apply)
      + zone    = "us-chi1"

      + ip_network {
          + address            = "10.0.0.0/24"
          + dhcp               = true
          + dhcp_default_route = (known after apply)
          + dhcp_dns           = (known after apply)
          + family             = "IPv4"
          + gateway            = (known after apply)
        }
    }

  # upcloud_server.lb[0] will be created
  + resource "upcloud_server" "lb" {
      + cpu      = (known after apply)
      + hostname = "lb-0"
      + id       = (known after apply)
      + mem      = (known after apply)
      + plan     = "1xCPU-1GB"
      + tags     = [
          + "swarm",
          + "lb",
        ]
      + title    = (known after apply)
      + zone     = "us-chi1"

      + login {
          + create_password   = false
          + keys              = [
              + "ssh-rsa AAAAB3NzaC1yc2EAAA",
            ]
          + password_delivery = "none"
          + user              = "patrick"
        }

      + network_interface {
          + bootable            = false
          + ip_address          = (known after apply)
          + ip_address_family   = "IPv4"
          + ip_address_floating = (known after apply)
          + mac_address         = (known after apply)
          + network             = (known after apply)
          + source_ip_filtering = true
          + type                = "public"
        }
      + network_interface {
          + bootable            = false
          + ip_address          = (known after apply)
          + ip_address_family   = "IPv4"
          + ip_address_floating = (known after apply)
          + mac_address         = (known after apply)
          + network             = (known after apply)
          + source_ip_filtering = true
          + type                = "utility"
        }
      + network_interface {
          + bootable            = false
          + ip_address          = (known after apply)
          + ip_address_family   = "IPv4"
          + ip_address_floating = (known after apply)
          + mac_address         = (known after apply)
          + network             = (known after apply)
          + source_ip_filtering = true
          + type                = "private"
        }

      + template {
          + address = (known after apply)
          + id      = (known after apply)
          + size    = 25
          + storage = "Ubuntu Server 20.04 LTS (Focal Fossa)"
          + tier    = (known after apply)
          + title   = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
2021-07-16T16:26:51.418-0400 [DEBUG] command: asking for input: "\nDo you want to perform these actions?"

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

2021-07-16T16:26:57.190-0400 [INFO]  backend/local: apply calling Apply
2021-07-16T16:26:57.190-0400 [INFO]  terraform: building graph: GraphTypeApply
2021-07-16T16:26:57.193-0400 [DEBUG] Resource state not found for node "upcloud_network.woogo-private-network", instance upcloud_network.woogo-private-network
2021-07-16T16:26:57.193-0400 [DEBUG] Resource state not found for node "upcloud_server.lb[0]", instance upcloud_server.lb[0]
2021-07-16T16:26:57.194-0400 [DEBUG] ProviderTransformer: "upcloud_server.lb[0]" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/upcloudltd/upcloud"]
2021-07-16T16:26:57.194-0400 [DEBUG] ProviderTransformer: "upcloud_network.woogo-private-network (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/upcloudltd/upcloud"]
2021-07-16T16:26:57.194-0400 [DEBUG] ProviderTransformer: "upcloud_server.lb (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/upcloudltd/upcloud"]
2021-07-16T16:26:57.194-0400 [DEBUG] ProviderTransformer: "upcloud_network.woogo-private-network" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/upcloudltd/upcloud"]
2021-07-16T16:26:57.195-0400 [DEBUG] ReferenceTransformer: "upcloud_network.woogo-private-network (expand)" references: []
2021-07-16T16:26:57.195-0400 [DEBUG] ReferenceTransformer: "upcloud_server.lb (expand)" references: []
2021-07-16T16:26:57.195-0400 [DEBUG] ReferenceTransformer: "var.public_key" references: []
2021-07-16T16:26:57.195-0400 [DEBUG] ReferenceTransformer: "var.zone" references: []
2021-07-16T16:26:57.195-0400 [DEBUG] ReferenceTransformer: "upcloud_network.woogo-private-network" references: []
2021-07-16T16:26:57.195-0400 [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-07-16T16:26:57.195-0400 [DEBUG] ReferenceTransformer: "upcloud_server.lb[0]" references: [upcloud_network.woogo-private-network (expand) upcloud_network.woogo-private-network upcloud_network.woogo-private-network var.public_key]
2021-07-16T16:26:57.195-0400 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/upcloudltd/upcloud\"]" references: []
2021-07-16T16:26:57.196-0400 [DEBUG] Starting graph walk: walkApply
2021-07-16T16:26:57.196-0400 [DEBUG] created provider logger: level=debug
2021-07-16T16:26:57.197-0400 [INFO]  provider: configuring client automatic mTLS
2021-07-16T16:26:57.237-0400 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 args=[.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1]
2021-07-16T16:26:57.240-0400 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=65183
2021-07-16T16:26:57.240-0400 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1
2021-07-16T16:26:57.252-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: configuring server automatic mTLS: timestamp=2021-07-16T16:26:57.252-0400
2021-07-16T16:26:57.289-0400 [DEBUG] provider.terraform-provider-upcloud_v2.1.1: plugin address: address=/var/folders/ck/v6sncj6n0h32mmm73qbm73p40000gn/T/plugin130708626 network=unix timestamp=2021-07-16T16:26:57.289-0400
2021-07-16T16:26:57.289-0400 [DEBUG] provider: using plugin: version=5
2021-07-16T16:26:57.333-0400 [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/upcloudltd/upcloud\"]" changed the config value, but that value is unused
upcloud_network.woogo-private-network: Creating...
2021-07-16T16:26:57.812-0400 [INFO]  Starting apply for upcloud_network.woogo-private-network
2021-07-16T16:26:57.812-0400 [DEBUG] upcloud_network.woogo-private-network: applying the planned Create change
2021-07-16T16:26:57.813-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:26:57 [DEBUG] setting computed for "ip_network.0.dhcp_dns" from ComputedKeys: timestamp=2021-07-16T16:26:57.813-0400
2021-07-16T16:26:57.813-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:26:57 [DEBUG] setting computed for "ip_network.0.dhcp_dns" from ComputedKeys: timestamp=2021-07-16T16:26:57.813-0400
2021-07-16T16:26:57.813-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:26:57 [DEBUG] setting computed for "servers" from ComputedKeys: timestamp=2021-07-16T16:26:57.813-0400
upcloud_network.woogo-private-network: Creation complete after 0s [id=03d3f136-90ce-45a7-a656-22dd3d386d78]
2021-07-16T16:26:58.506-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:26:58 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2021-07-16T16:26:58.506-0400
2021-07-16T16:26:58.510-0400 [WARN]  Provider "registry.terraform.io/upcloudltd/upcloud" produced an invalid plan for upcloud_server.lb[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .network_interface[0].bootable: planned value cty.False for a non-computed attribute
      - .network_interface[0].ip_address_family: planned value cty.StringVal("IPv4") for a non-computed attribute
      - .network_interface[0].source_ip_filtering: planned value cty.True for a non-computed attribute
      - .network_interface[1].source_ip_filtering: planned value cty.True for a non-computed attribute
      - .network_interface[1].bootable: planned value cty.False for a non-computed attribute
      - .network_interface[1].ip_address_family: planned value cty.StringVal("IPv4") for a non-computed attribute
      - .network_interface[2].source_ip_filtering: planned value cty.True for a non-computed attribute
      - .network_interface[2].bootable: planned value cty.False for a non-computed attribute
      - .network_interface[2].ip_address_family: planned value cty.StringVal("IPv4") for a non-computed attribute
upcloud_server.lb[0]: Creating...
2021-07-16T16:26:58.510-0400 [INFO]  Starting apply for upcloud_server.lb[0]
2021-07-16T16:26:58.512-0400 [DEBUG] upcloud_server.lb[0]: applying the planned Create change
2021-07-16T16:27:03.987-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:27:03 [INFO] Server lb-0 (managed by terraform) with UUID 009dfb7c-829b-49b9-be87-3c869f327ff6 created: timestamp=2021-07-16T16:27:03.987-0400
╷
│ Error: The requested action is forbidden. (ACTION_FORBIDDEN)
│ 
│   with upcloud_server.lb[0],
│   on infra.tf line 93, in resource "upcloud_server" "lb":
│   93: resource "upcloud_server" "lb" {
│ 
╵
2021-07-16T16:27:04.286-0400 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-07-16T16:27:04.288-0400 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=65183
2021-07-16T16:27:04.288-0400 [DEBUG] provider: plugin exited
➜  terraform git:(main) ✗ terraform apply
2021-07-16T16:27:12.719-0400 [DEBUG] Adding temp file log sink: /var/folders/ck/v6sncj6n0h32mmm73qbm73p40000gn/T/terraform-log563718556
2021-07-16T16:27:12.719-0400 [INFO]  Terraform version: 1.0.2
2021-07-16T16:27:12.719-0400 [INFO]  Go runtime version: go1.16.5
2021-07-16T16:27:12.719-0400 [INFO]  CLI args: []string{"/usr/local/bin/terraform", "apply"}
2021-07-16T16:27:12.719-0400 [DEBUG] Attempting to open CLI config file: /Users/patrickleblanc/.terraformrc
2021-07-16T16:27:12.719-0400 [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2021-07-16T16:27:12.719-0400 [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2021-07-16T16:27:12.719-0400 [DEBUG] ignoring non-existing provider search directory /Users/patrickleblanc/.terraform.d/plugins
2021-07-16T16:27:12.719-0400 [DEBUG] ignoring non-existing provider search directory /Users/patrickleblanc/Library/Application Support/io.terraform/plugins
2021-07-16T16:27:12.719-0400 [DEBUG] ignoring non-existing provider search directory /Library/Application Support/io.terraform/plugins
2021-07-16T16:27:12.720-0400 [INFO]  CLI command args: []string{"apply"}
2021-07-16T16:27:12.722-0400 [DEBUG] New state was assigned lineage "ff55b00b-bf30-1f35-8806-b1eb13c5ebab"
2021-07-16T16:27:12.774-0400 [DEBUG] checking for provisioner in "."
2021-07-16T16:27:12.779-0400 [DEBUG] checking for provisioner in "/usr/local/bin"
2021-07-16T16:27:12.779-0400 [INFO]  Failed to read plugin lock file .terraform/plugins/darwin_amd64/lock.json: open .terraform/plugins/darwin_amd64/lock.json: no such file or directory
2021-07-16T16:27:12.779-0400 [INFO]  backend/local: starting Apply operation
2021-07-16T16:27:12.783-0400 [DEBUG] created provider logger: level=debug
2021-07-16T16:27:12.783-0400 [INFO]  provider: configuring client automatic mTLS
2021-07-16T16:27:12.822-0400 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 args=[.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1]
2021-07-16T16:27:12.825-0400 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=65203
2021-07-16T16:27:12.826-0400 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1
2021-07-16T16:27:12.838-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: configuring server automatic mTLS: timestamp=2021-07-16T16:27:12.837-0400
2021-07-16T16:27:12.878-0400 [DEBUG] provider: using plugin: version=5
2021-07-16T16:27:12.878-0400 [DEBUG] provider.terraform-provider-upcloud_v2.1.1: plugin address: address=/var/folders/ck/v6sncj6n0h32mmm73qbm73p40000gn/T/plugin950261038 network=unix timestamp=2021-07-16T16:27:12.878-0400
2021-07-16T16:27:12.932-0400 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-07-16T16:27:12.933-0400 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=65203
2021-07-16T16:27:12.933-0400 [DEBUG] provider: plugin exited
2021-07-16T16:27:12.934-0400 [INFO]  terraform: building graph: GraphTypeValidate
2021-07-16T16:27:12.934-0400 [DEBUG] ProviderTransformer: "upcloud_network.woogo-private-network" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/upcloudltd/upcloud"]
2021-07-16T16:27:12.934-0400 [DEBUG] ProviderTransformer: "upcloud_server.lb" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/upcloudltd/upcloud"]
2021-07-16T16:27:12.935-0400 [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-07-16T16:27:12.935-0400 [DEBUG] ReferenceTransformer: "upcloud_server.lb" references: [upcloud_network.woogo-private-network var.public_key]
2021-07-16T16:27:12.935-0400 [DEBUG] ReferenceTransformer: "var.public_key" references: []
2021-07-16T16:27:12.935-0400 [DEBUG] ReferenceTransformer: "var.zone" references: []
2021-07-16T16:27:12.935-0400 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/upcloudltd/upcloud\"]" references: []
2021-07-16T16:27:12.935-0400 [DEBUG] ReferenceTransformer: "upcloud_network.woogo-private-network" references: []
2021-07-16T16:27:12.935-0400 [DEBUG] Starting graph walk: walkValidate
2021-07-16T16:27:12.936-0400 [DEBUG] created provider logger: level=debug
2021-07-16T16:27:12.936-0400 [INFO]  provider: configuring client automatic mTLS
2021-07-16T16:27:12.973-0400 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 args=[.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1]
2021-07-16T16:27:12.976-0400 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=65204
2021-07-16T16:27:12.976-0400 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1
2021-07-16T16:27:12.988-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: configuring server automatic mTLS: timestamp=2021-07-16T16:27:12.988-0400
2021-07-16T16:27:13.025-0400 [DEBUG] provider.terraform-provider-upcloud_v2.1.1: plugin address: address=/var/folders/ck/v6sncj6n0h32mmm73qbm73p40000gn/T/plugin956767851 network=unix timestamp=2021-07-16T16:27:13.025-0400
2021-07-16T16:27:13.025-0400 [DEBUG] provider: using plugin: version=5
2021-07-16T16:27:13.074-0400 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-07-16T16:27:13.075-0400 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=65204
2021-07-16T16:27:13.075-0400 [DEBUG] provider: plugin exited
2021-07-16T16:27:13.075-0400 [INFO]  backend/local: apply calling Plan
2021-07-16T16:27:13.075-0400 [INFO]  terraform: building graph: GraphTypePlan
2021-07-16T16:27:13.076-0400 [DEBUG] ProviderTransformer: "upcloud_network.woogo-private-network (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/upcloudltd/upcloud"]
2021-07-16T16:27:13.076-0400 [DEBUG] ProviderTransformer: "upcloud_server.lb (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/upcloudltd/upcloud"]
2021-07-16T16:27:13.076-0400 [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-07-16T16:27:13.076-0400 [DEBUG] ReferenceTransformer: "upcloud_server.lb (expand)" references: [upcloud_network.woogo-private-network (expand) var.public_key]
2021-07-16T16:27:13.076-0400 [DEBUG] ReferenceTransformer: "var.public_key" references: []
2021-07-16T16:27:13.076-0400 [DEBUG] ReferenceTransformer: "var.zone" references: []
2021-07-16T16:27:13.076-0400 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/upcloudltd/upcloud\"]" references: []
2021-07-16T16:27:13.076-0400 [DEBUG] ReferenceTransformer: "upcloud_network.woogo-private-network (expand)" references: []
2021-07-16T16:27:13.077-0400 [DEBUG] Starting graph walk: walkPlan
2021-07-16T16:27:13.077-0400 [DEBUG] created provider logger: level=debug
2021-07-16T16:27:13.077-0400 [INFO]  provider: configuring client automatic mTLS
2021-07-16T16:27:13.110-0400 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 args=[.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1]
2021-07-16T16:27:13.112-0400 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=65205
2021-07-16T16:27:13.113-0400 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1
2021-07-16T16:27:13.122-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: configuring server automatic mTLS: timestamp=2021-07-16T16:27:13.122-0400
2021-07-16T16:27:13.157-0400 [DEBUG] provider: using plugin: version=5
2021-07-16T16:27:13.157-0400 [DEBUG] provider.terraform-provider-upcloud_v2.1.1: plugin address: address=/var/folders/ck/v6sncj6n0h32mmm73qbm73p40000gn/T/plugin586238792 network=unix timestamp=2021-07-16T16:27:13.157-0400
2021-07-16T16:27:13.211-0400 [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/upcloudltd/upcloud\"]" changed the config value, but that value is unused
2021-07-16T16:27:13.677-0400 [DEBUG] ReferenceTransformer: "upcloud_network.woogo-private-network" references: []
upcloud_network.woogo-private-network: Refreshing state... [id=03d3f136-90ce-45a7-a656-22dd3d386d78]
2021-07-16T16:27:13.806-0400 [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-07-16T16:27:13.806-0400 [INFO]  ReferenceTransformer: reference not found: "var.public_key"
2021-07-16T16:27:13.806-0400 [DEBUG] ReferenceTransformer: "upcloud_server.lb[0]" references: []
upcloud_server.lb[0]: Refreshing state... [id=009dfb7c-829b-49b9-be87-3c869f327ff6]
2021-07-16T16:27:13.933-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:27:13 [DEBUG] Configured storage devices in state: &{F:0x15d9040 m:map[] once:{done:0 m:{state:0 sema:0}}}: timestamp=2021-07-16T16:27:13.933-0400
2021-07-16T16:27:13.933-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:27:13 [DEBUG] Actual storage devices on server: [{virtio:0 yes 011545b0-81b8-412a-9cb6-ba9b7d328380 25 maxiops terraform-lb-0-disk disk 0}]: timestamp=2021-07-16T16:27:13.933-0400
2021-07-16T16:27:13.935-0400 [WARN]  Provider "registry.terraform.io/upcloudltd/upcloud" produced an unexpected new value for upcloud_server.lb[0] during refresh.
      - .cpu: was null, but now cty.NumberIntVal(1)
      - .firewall: was null, but now cty.False
      - .metadata: was null, but now cty.False
      - .mem: was null, but now cty.NumberIntVal(1024)
      - .tags: element 0 has vanished
      - .tags: element 1 has vanished
      - .title: was null, but now cty.StringVal("lb-0 (managed by terraform)")
      - .network_interface[0].mac_address: was cty.StringVal(""), but now cty.StringVal("86:95:6a:dc:4b:32")
      - .network_interface[0].network: was cty.StringVal(""), but now cty.StringVal("03000000-0000-4000-8079-000000000000")
      - .network_interface[0].ip_address: was cty.StringVal(""), but now cty.StringVal("152.44.34.99")
      - .network_interface[1].network: was cty.StringVal(""), but now cty.StringVal("03236a78-32a5-4437-ad54-dd579a75d0c0")
      - .network_interface[1].ip_address: was cty.StringVal(""), but now cty.StringVal("10.3.8.161")
      - .network_interface[1].mac_address: was cty.StringVal(""), but now cty.StringVal("86:95:6a:dc:f6:c4")
      - .network_interface[2].ip_address: was cty.StringVal(""), but now cty.StringVal("10.0.0.2")
      - .network_interface[2].mac_address: was cty.StringVal(""), but now cty.StringVal("86:95:6a:dc:a6:44")
      - .storage_devices: actual set element cty.ObjectVal(map[string]cty.Value{"address":cty.StringVal("virtio"), "storage":cty.StringVal("011545b0-81b8-412a-9cb6-ba9b7d328380"), "type":cty.StringVal("disk")}) does not correlate with any element in plan
      - .storage_devices: block set length changed from 0 to 1
2021-07-16T16:27:13.937-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:27:13 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2021-07-16T16:27:13.937-0400
2021-07-16T16:27:13.940-0400 [WARN]  Provider "registry.terraform.io/upcloudltd/upcloud" produced an invalid plan for upcloud_server.lb[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .network_interface[0].source_ip_filtering: planned value cty.True for a non-computed attribute
      - .network_interface[0].bootable: planned value cty.False for a non-computed attribute
      - .network_interface[0].ip_address_family: planned value cty.StringVal("IPv4") for a non-computed attribute
      - .network_interface[1].source_ip_filtering: planned value cty.True for a non-computed attribute
      - .network_interface[1].bootable: planned value cty.False for a non-computed attribute
      - .network_interface[1].ip_address_family: planned value cty.StringVal("IPv4") for a non-computed attribute
      - .network_interface[2].source_ip_filtering: planned value cty.True for a non-computed attribute
      - .network_interface[2].bootable: planned value cty.False for a non-computed attribute
      - .network_interface[2].ip_address_family: planned value cty.StringVal("IPv4") for a non-computed attribute
2021-07-16T16:27:13.942-0400 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-07-16T16:27:13.944-0400 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=65205
2021-07-16T16:27:13.944-0400 [DEBUG] provider: plugin exited

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # upcloud_server.lb[0] has been changed
  ~ resource "upcloud_server" "lb" {
      + cpu      = 1
      + firewall = false
        id       = "009dfb7c-829b-49b9-be87-3c869f327ff6"
      + mem      = 1024
      + metadata = false
      ~ tags     = [
          - "swarm",
          - "lb",
        ]
      + title    = "lb-0 (managed by terraform)"
        # (3 unchanged attributes hidden)


      ~ network_interface {
          + ip_address          = "152.44.34.99"
          + mac_address         = "86:95:6a:dc:4b:32"
          + network             = "03000000-0000-4000-8079-000000000000"
            # (5 unchanged attributes hidden)
        }
      ~ network_interface {
          + ip_address          = "10.3.8.161"
          + mac_address         = "86:95:6a:dc:f6:c4"
          + network             = "03236a78-32a5-4437-ad54-dd579a75d0c0"
            # (5 unchanged attributes hidden)
        }
      ~ network_interface {
          + ip_address          = "10.0.0.2"
          + mac_address         = "86:95:6a:dc:a6:44"
            # (6 unchanged attributes hidden)
        }

      + storage_devices {
          + address = "virtio"
          + storage = "011545b0-81b8-412a-9cb6-ba9b7d328380"
          + type    = "disk"
        }

        # (2 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond to these changes.

──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # upcloud_server.lb[0] is tainted, so must be replaced
-/+ resource "upcloud_server" "lb" {
      ~ cpu      = 1 -> (known after apply)
      - firewall = false -> null
      ~ id       = "009dfb7c-829b-49b9-be87-3c869f327ff6" -> (known after apply)
      ~ mem      = 1024 -> (known after apply)
      - metadata = false -> null
      ~ tags     = [
          + "swarm",
          + "lb",
        ]
      ~ title    = "lb-0 (managed by terraform)" -> (known after apply)
        # (3 unchanged attributes hidden)


      ~ network_interface {
          ~ ip_address          = "152.44.34.99" -> (known after apply)
          ~ ip_address_floating = false -> (known after apply)
          ~ mac_address         = "86:95:6a:dc:4b:32" -> (known after apply)
          ~ network             = "03000000-0000-4000-8079-000000000000" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ network_interface {
          ~ ip_address          = "10.3.8.161" -> (known after apply)
          ~ ip_address_floating = false -> (known after apply)
          ~ mac_address         = "86:95:6a:dc:f6:c4" -> (known after apply)
          ~ network             = "03236a78-32a5-4437-ad54-dd579a75d0c0" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ network_interface {
          ~ ip_address          = "10.0.0.2" -> (known after apply)
          ~ ip_address_floating = false -> (known after apply)
          ~ mac_address         = "86:95:6a:dc:a6:44" -> (known after apply)
            # (5 unchanged attributes hidden)
        }

      - storage_devices {
          - address = "virtio" -> null
          - storage = "011545b0-81b8-412a-9cb6-ba9b7d328380" -> null
          - type    = "disk" -> null
        }

      ~ template {
          + address = (known after apply)
          + id      = (known after apply)
          + tier    = (known after apply)
          ~ title   = "terraform-lb-0-disk" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
2021-07-16T16:27:13.953-0400 [DEBUG] command: asking for input: "\nDo you want to perform these actions?"

```